name_assistant = "Я твой ассистент. Меня зовут Линда"
print(name_assistant)

name_user = input("Как мне к тебе обращатся: ")
print("Приятно познакомиться,", name_user)

age_user = input("Теперь я знаю как тебя зовут. А сколько тебе сейчас лет? ")
big_age_user = input("Ого, ты взрослый человек. Представляешь, через 10 лет тебе будет: " + str(int(age_user) + 10))

print(name_user)
print(age_user)
print(name_assistant)

rise_user = float(input("Насколько ты высок? (в метрах): "))

rise_assistant = 0.53
diference = rise_user - rise_assistant
print("Ты выше ассистента на", diference, "метров")

print("Итак,", name_user, "! Вот что я о тебе узнала:\nТвоё имя:", name_user, "\nТвой возраст:", age_user, "лет\nТвой рост:", rise_user, "метров\nТы выше меня на", diference, "метров")

print("""Чем именно Вам помочь:
1. Поднять настроение!
2. напомнить покормить кота!
3. Рассказать про лучшее место на земле!""")

answer = input("Ваш выбор (введите номер): ")

if answer == "1":
    print("""Отличный способ за 5 минут улучшить настроение - побаловать себя любимым напитком. Это может быть золотой или чёрный чай, кофе, какао, горячий шоколад, фруктово-ягодный коктейль.""")
elif answer == "2":
    print("Что ты выберешь? 2")
    print("""Выберите возраст кошки:
1. До года
2. Больше года""")
    
    cat_age = input("Ваш выбор: ")
    
    if cat_age == "1":
        print("Кот до года съедает кормушку несколько раз в сутки: в 2-3 месяца – пять раз в день, а 4-5 месяцев – четыре раза, в 6-12 месяцев – три раза.")
    elif cat_age == "2":
        print("Кот старше года ест два раза в день.")
    else:
        print("Я не понимаю ваш выбор. Введите 1 или 2.")

elif answer == "3":
    print("Лучшее место на земле, Татьяна, там, где твоя семья.")
else:
    print("Извините, я вас не понимаю. Пожалуйста, введите 1, 2 или 3.")